Repository: HossamSherraa/FileSharingKitDemo
Catalog: *.lproj/Localizable.strings
Languages: ar

source: Connect with QR
ar: مسح رمز الاستجابة السريع

source: Connect
ar: الاتصال

source: Connected Devices
ar: الأجهزة المتصلة

source: Finding Devices
ar: البحث عن الأجهزة

source: QR Code
ar: رمز الاستجابة السريعة

source: Pairing
ar: الإقران

source: Close
ar: إغلاق

source: Wrong Passcode
ar: رمز المرور خاطئ

source: Open Folder
ar: فتح المجلد

source: Stop Sharing
ar: إيقاف المشاركة

source: Disconnect
ar: قطع الاتصال

source: Server
ar: مشاركة

source: Start Sharing
ar: بدأ المشاركة

source: File Sharing
ar: مشاركة الملفات

source: Trusted Devices
ar: الأجهزة الموثوقة

source: Untrust
ar: الغاء الثقة

source: Common Questions
ar: الأسئلة الشائعة

source: Why can't I see any devices when I search for them on the app?
ar: لماذا لا يمكنني رؤية أي أجهزة عندما أبحث عنها في التطبيق؟

source: There could be a few reasons for this. First, make sure that all devices are connected to the same Wi-Fi network. If they are, try restarting the app and/or the Wi-Fi on all devices. Additionally, some routers have settings that can restrict local network communication, so you may need to check your router's settings or consult with your network administrator.
ar: قد تكون هناك عدة أسباب لذلك. أولاً ، تأكد من أن جميع الأجهزة متصلة بشبكة Wi-Fi نفسها. وإذا كانت كذلك ، فحاول إعادة تشغيل التطبيق و / أو شبكة Wi-Fi على جميع الأجهزة. بالإضافة إلى ذلك ، فإن بعض أجهزة التوجيه لديك إعدادات يمكنها تقييد اتصال الشبكة المحلية ، لذلك قد تحتاج إلى التحقق من إعدادات جهاز التوجيه أو استشارة مسؤول الشبكة.

source: Why is the transfer of data taking so long?
ar: لماذا يستغرق نقل البيانات كل هذا الوقت الطويل؟

source: Slow transfer speeds can be caused by a variety of factors, including poor Wi-Fi signal strength, interference from other devices, or large file sizes. Try moving the devices closer together, closing any other apps that may be using Wi-Fi.
ar: يمكن أن تحدث سرعات النقل البطيئة بسبب مجموعة متنوعة من العوامل ، بما في ذلك ضعف قوة إشارة Wi-Fi ، أو التداخل من الأجهزة الأخرى ، أو أحجام الملفات الكبيرة. حاول تقريب الأجهزة من بعضها البعض ، وإغلاق أي تطبيقات أخرى ربما تستخدم Wi-Fi.

source: I'm getting an error message saying the QR code failed. What should I do?
ar: أتلقى رسالة خطأ تفيد بفشل رمز الاستجابة السريعة. ماذا أفعل؟

source: If the QR code failed, double-check that both devices are connected to the same Wi-Fi network and that the other device is online. If everything seems to be in order, try restarting the app on both devices and scanning the QR code again.
ar: إذا فشل رمز الاستجابة السريعة ، فتحقق جيدًا من أن كلا الجهازين متصلان بشبكة Wi-Fi نفسها وأن الجهاز الآخر متصل بالإنترنت. إذا بدا أن كل شيء على ما يرام ، فحاول إعادة تشغيل التطبيق على كلا الجهازين ومسح رمز الاستجابة السريعة ضوئيًا مرة أخرى.

source: I'm having trouble entering the passcode for the other device. What's wrong?
ar: أواجه مشكلة في إدخال رمز المرور للجهاز الآخر. ما هو الخطأ؟

source: Double-check that you are entering the passcode correctly and that the other device is online and connected to the same Wi-Fi network. If you are still having trouble, try restarting the app on both devices and entering the passcode again.
ar: تحقق جيدًا من إدخال رمز المرور بشكل صحيح وأن الجهاز الآخر متصل بالإنترنت ومتصل بشبكة Wi-Fi نفسها. إذا كنت لا تزال تواجه مشكلة ، فحاول إعادة تشغيل التطبيق على كلا الجهازين وإدخال رمز المرور مرة أخرى.
